
## Plan Result (portfolio/domains)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2811030826)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.root_domain.aws_route53_zone.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.root_domain.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "portfolio.tqer39.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/terraform/environments/portfolio/domains"
        }
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":127,"Program":"tfcmt","SHA1":"476bd037db5de005c97c98126afadd8aa418ccce","Target":"portfolio/domains","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->